# questions.py

QUESTIONS = [
    ("Какой язык программирования используется для веб-разработки?", 
     ["Python", "HTML", "C++", "Java"], 
     1),
    
    ("Сколько будет 2 + 2 * 2?", 
     ["6", "8", "4", "2"], 
     0),
    
    ("Столица Франции?", 
     ["Берлин", "Мадрид", "Париж", "Рим"], 
     2),
    
    ("Кто написал 'Войну и мир'?", 
     ["Достоевский", "Толстой", "Пушкин", "Гоголь"], 
     1),
    
    ("Какой планете ближе всего Солнце?", 
     ["Марс", "Земля", "Венера", "Меркурий"], 
     3),
    
    ("Какой элемент обозначается символом 'O'?", 
     ["Озон", "Олово", "Кислород", "Золото"], 
     2),
    
    ("Что делает функция `len()` в Python?", 
     ["Добавляет элемент", "Возвращает длину", "Удаляет элемент", "Сортирует"], 
     1),
    
    ("Сколько цветов в радуге?", 
     ["5", "6", "7", "8"], 
     2),
    
    ("Сколько бит в одном байте?", 
     ["4", "8", "16", "32"], 
     1),
    
    ("Какой год считается началом Второй мировой войны?", 
     ["1941", "1939", "1914", "1945"], 
     1),
]
